In [1]:
import pandas as pd

In [2]:
international_debt = pd.read_csv("international_debt.csv")

In [3]:
%%sql
SELECT country_name, AVG(debt) AS average_debt
FROM international_debt
GROUP BY country_name
ORDER BY average_debt DESC;

                                     country_name  average_debt
0                                           China  1.190806e+10
1                                          Brazil  1.169267e+10
2                                      South Asia  1.031703e+10
3                              Russian Federation  9.109003e+09
4    Least developed countries: UN classification  8.515240e+09
..                                            ...           ...
119                                   Timor-Leste  7.100096e+06
120                                      Dominica  6.902215e+06
121                                       Comoros  4.797374e+06
122                         Sao Tome and Principe  3.733169e+06
123                                         Tonga  3.680620e+06

[124 rows x 2 columns]

In [5]:
%%sql
SELECT country_name, (SUM(debt) / (SELECT SUM(debt) FROM international_debt) * 100) AS percentage_contribution
FROM international_debt
GROUP BY country_name
ORDER BY percentage_contribution DESC;

                                     country_name  percentage_contribution
0                                           China                 9.279810
1                                          Brazil                 9.111953
2                                      South Asia                 8.039937
3    Least developed countries: UN classification                 6.912316
4                              Russian Federation                 6.211219
..                                            ...                      ...
119                                  Turkmenistan                 0.003089
120                                   Timor-Leste                 0.002305
121                                       Comoros                 0.001869
122                                         Tonga                 0.001793
123                         Sao Tome and Principe                 0.001455

[124 rows x 2 columns]

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql